Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །སྣང་བ་དང་། མི་སྣང་བ་ཡང་ཉམས་སུ་མྱོང་བར་བྱེད་དོ།
en: They may also experience themselves as visible and as invisible.

source: །རྩིག་པ་ལས་ཐལ་བ་དང་།
en: They can move directly through walls.

source: ར་བ་ལས་ཐལ་བ་དང་།
en: They can move directly through enclosures.

source: རི་ལས་ཐལ་བ་ཐོགས་པ་མེད་པར་འགྲོ་སྟེ། དཔེར་ན་ནམ་མཁའ་ལ་བྱ་བ་བཞིན་ནོ།
en: They can move directly through mountains, unimpededly, as if in space.

source: །ནམ་མཁའ་ལ་ཡང་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ།
en: They can also move through space like a bird.

source: །དུ་བར་འཐུལ་ཞིང་མེར་འབར་ཏེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ།
en: They can also emit smoke and blaze as fire, like a great conflagration.

source: །ཉི་མ་དང་། ཟླ་བ་འདི་དག་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ལ་འདི་ལྟར་མཐུ་ཆེ་ཞིང་།
en: However miraculous, powerful, and mighty the sun and the moon might be, they can stroke them with their hands.

source: དབང་ཆེ་བ་དེ་དག་ཀྱང་ལག་པས་བྱུགས་ཤིང་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ།
en: They can even outshine [the god realms], up to and including the Brahmā realms, with their physical bodies. “

source: །དེ་ལྟའི་རྣ་བ་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། ལྷ་དང་མིའི་སྒྲ་ཉེ་འམ་རིང་ཡང་རུང་སྟེ་ཐོས་སོ།
en: Since they have pure divine clairaudience, which surpasses the hearing of human beings, they can hear the voices of gods and humans, near or far.

source: །དེ་སེམས་ཅན་ཕ་རོལ་དང་གང་ཟག་ཕ་རོལ་གྱི་སེམས་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ་འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ལ།
en: They can correctly know with their own minds the minds of other beings and the minds of other persons, exactly as they are.

source: འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །བླ་ན་མེད་པའི་སེམས་ཀྱི་བར་ལ་བླ་ན་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: That is to say, they correctly know minds that are afflicted with desire as minds that are afflicted with desire, and they correctly know [other mindsets], up to and including minds that are unsurpassed, as minds that are unsurpassed [and so forth]. “

source: །དེ་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ་སེམས་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས་སེམས་བརྒྱའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: They can recollect many facets of past lives. That is to say, they may recollect anything from a single thought up to even a hundred thoughts.

source: །བསྐལ་པ་གཅིག་གི་བར་དུ་རྗེས་སུ་དྲན་པ་ནས་བསྐལ་པ་བརྒྱའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: They may recollect [any period of time], up to and including a single eon, and they may even recollect anything from that up to and including a hundred eons.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ཏེ། བདག་ནི་དེ་ལྟ་བུ་ཞིག་ན་འདུག་འདུག་སྟེ།
en: They may even recollect [any any period], up to and including many hundred billion trillions of eons, thinking, ‘Such was I [in that life].

source: དེ་ལྟར་བདག་འདི་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ་ཞེས་བྱ་བ་ནས། དེ་ནས་ཤི་འཕོས་ནས་ནི་འདིར་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུ་རྣམ་པ་དང་བཅས། གཏན་ཚིགས་དང་བཅས།
en: Deceased from there, I transmigrated and was born as so-and-so, and then dying there and transmigrating, I have been reborn here!’

source: དན་རྟགས་དང་བཅས་པར་བདག་དང་གཞན་གྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མར་རྗེས་སུ་དྲན་ནོ།
en: To that extent, they can recollect in many details their own past lives and those of others, along with their circumstances, causal bases, and evidence.

source: །དེ་ནི་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། སེམས་ཅན་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་ནས་སེམས་ཅན་རྣམས་ལས་གཞན་དུ་འགྲོ་བའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། དེ་མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་ལ་གནས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱ་བ་དང་།
en: They can correctly know through their pure clairvoyance surpassing the vision of humans those beings who are dying and transmigrating, and those who are reborn, and then proceed to other realms in accordance with their past actions. “

source: ཡོངས་སུ་དྲི་བ་དང་། ཡོངས་སུ་ཞུ་བ་དང་། དགེ་བའི་རྩ་བ་བསགས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ།
en: Abiding in these five extrasensory powers, in order to venerate, question, and counter-question the lord buddhas, to develop the roots of virtuous action, and also to bring beings to maturation and refine the buddhafields, they move from buddhafield to buddhafield. {

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡོངས་སུ་མི་བསྔོའི། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་།
en: Ki.V: 96} They do not dedicate these roots of virtuous action to the level of the śrāvakas or the level of the pratyekabuddhas, but making common cause with all beings, dedicate them toward unsurpassed, complete enlightenment.

source: ཅི་ནས་ཀྱང་གང་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བའི་བློ་རྣམ་པ་གསུམ་དུ་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: And they make this dedication in such a way that by all means they do not resort to the threefold mental interaction between the one who makes the dedication, the dedication that is made, and the one to whom the dedication is made.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of perseverance.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of meditative concentration, acquire the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པས། གཟུགས་མི་དམིགས་སོ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of meditative concentration, do not apprehend physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་དམིགས་སོ།
en: They do not apprehend feelings, perceptions, formative predispositions, or consciousness.

source: མིག་མི་དམིགས་སོ། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་།
en: They do not apprehend the eyes, and they do not apprehend the ears, nose, tongue, body, or mental faculty.

source: ཡིད་མི་དམིགས་སོ། །གཟུགས་མི་དམིགས་སོ། །སྒྲ་དང་། དྲི་དང་རོ་དང་རེག་དང་། ཆོས་མི་དམིགས་སོ།
en: They do not apprehend sights, and they do not apprehend sounds, odors, tastes, tangibles, or mental phenomena.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་མི་དམིགས་སོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་དུ་མི་དམིགས་སོ།
en: They do not apprehend visual consciousness, and they do not apprehend [the other aspects of consciousness], up to and including mental consciousness.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་མི་དམིགས་སོ། །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་བར་དུ་མི་དམིགས་སོ།
en: They do not apprehend visually compounded sensory contact, and they do not apprehend [the other aspects of sensory contact], up to and including mentally compounded sensory contact.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་མི་དམིགས་སོ། །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བའི་བར་དུ་མི་དམིགས་སོ།
en: They do not apprehend feelings conditioned by visually compounded sensory contact, and they do not apprehend [the other aspects of feelings conditioned by sensory contact], up to and including feelings conditioned by mentally compounded sensory contact.

source: །སའི་ཁམས་མི་དམིགས་སོ། །རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་མི་དམིགས་སོ།
en: They do not apprehend the earth element, and they do not apprehend [the other elements], up to and including the consciousness element.

source: །མ་རིག་པ་མི་དམིགས་སོ། །རྒ་ཤིའི་བར་དུ་མི་དམིགས་སོ། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They do not apprehend ignorance, and they do not apprehend [the other links of dependent origination], up to and including aging and death.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They do not apprehend the perfection of generosity, and they do not apprehend the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་མི་དམིགས་སོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་སོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་སོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They do not apprehend the emptiness of internal phenomena, and they do not apprehend [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་དམིགས་སོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: They do not apprehend the applications of mindfulness, and they do not apprehend the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམིགས་སོ།
en: They do not apprehend the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, [great loving kindness], great compassion, or the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་སོ།
en: They do not apprehend [the goals], up to and including all-aspect omniscience.

source: །འདུས་བྱས་ཀྱི་ཁམས་མི་དམིགས་སོ། །འདུས་མ་བྱས་ཀྱི་ཁམས་མི་དམིགས་སོ།
en: They do not apprehend conditioned elements, and they do not apprehend unconditioned elements.

source: །དེ་ལྟར་མི་དམིགས་པས་ན་མངོན་པར་འདུ་མི་བྱེད་དོ།
en: Since, in that manner, they do not apprehend anything, they do not condition anything at all.

source: །མངོན་པར་འདུ་མི་བྱེད་པས་ན་སྐྱེ་བ་འམ་འགག་པ་མི་བྱེད་དོ།
en: Since they do not condition anything at all, they neither cause anything to arise, nor do they cause anything to cease.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་གནས་ཉིད་དེ་ནི་གནས་པ་སྟེ། ཆོས་ཀྱི་དབྱིངས་དེ་བཞིན་གནས་པའི་ཕྱིར་དེ་མི་སྐྱེ་མི་འགག་པས།
en: If you ask why, Subhūti, it is because, whether the tathāgatas have appeared or not, the presence of all phenomena continues to be present, and the realm of phenomena similarly continues to be present, and so there is neither arising nor ceasing.

source: དེ་གཡེང་བ་མེད་པའི་སེམས་དང་ལྡན་པར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་མ་བྲལ་བ་ཡིན་ཏེ།
en: Bodhisattva great beings, with undistracted minds, never part from directing their minds to all-aspect omniscience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that, abiding in the perfection of meditative concentration, they acquire the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of generosity?” {

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་སྟོང་པའོ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: V: 97} “In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they do not observe the notion that all phenomena are empty.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་སྟོང་པའོ་ཞེས་བགྱི་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ལགས།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they not observe the notion that all phenomena are empty?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་སྟོང་པ་ཉིད་ལ་ནང་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they do not apprehend the emptiness of internal phenomena as the emptiness of internal phenomena.

source: །ཕྱི་སྟོང་པ་ཉིད་ལ་ཕྱི་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of external phenomena as the emptiness of external phenomena.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་ཕྱི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of external and internal phenomena as the emptiness of external and internal phenomena.

source: །སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of emptiness as the emptiness of emptiness.

source: །ཆེན་པོ་སྟོང་པ་ཉིད་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of great extent as the emptiness of great extent.

source: །དོན་དམ་པ་སྟོང་པ་ཉིད་ལ་དོན་དམ་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of ultimate reality as the emptiness of ultimate reality.

source: །འདུས་བྱས་སྟོང་པ་ཉིད་ལ་འདུས་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of conditioned phenomena as the emptiness of conditioned phenomena.

source: །འདུས་མ་བྱས་སྟོང་པ་ཉིད་ལ་འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of unconditioned phenomena as the emptiness of unconditioned phenomena.

source: །མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ལ་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of the unlimited as the emptiness of the unlimited.

source: །ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ལ་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of that which has neither beginning nor end as the emptiness of that which has neither beginning nor end.

source: །དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ལ་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of nonexclusion as the emptiness of nonexclusion.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ལ་རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of inherent existence as the emptiness of inherent existence.

source: །ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the emptiness of all phenomena as the emptiness of all phenomena.

source: །རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ལ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་མི་དམིགས་ཏེ།
en: They do not apprehend the emptiness of all intrinsic defining characteristics as the emptiness of all intrinsic defining characteristics.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྟོང་པ་ཉིད་བཅུ་བཞི་པོ་དེ་དག་ལ་གནས་ཤིང་། གཟུགས་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: Abiding in these fourteen aspects of emptiness, bodhisattva great beings do not apprehend the notion that physical forms are empty, or the notion that they are not empty.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that feelings, perceptions, formative predispositions, and consciousness are empty, or the notion that they are not empty. Similarly, they do not apprehend the notion that the applications of mindfulness are empty, or the notion that they are not empty.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that the sense fields, the sensory elements, and the links of dependent origination are empty, or that they are not empty.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ། །འཕགས་པའི་བདེན་པ་དང་།
en: They do not apprehend the notion that all the perfections and the thirty-seven factors conducive to enlightenment are empty, or the notion that they are not empty.

source: བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, and the nine serial steps of meditative absorption are empty, or the notion that they are not empty.

source: །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that emptiness, signlessness, and wishlessness are empty, or the notion that they are not empty.

source: །མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty, or the notion that they are not empty.

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty, or the notion that they are not empty.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that [the goals], up to and including unsurpassed, complete enlightenment, are empty, or the notion that they are not empty.

source: །འདུས་བྱས་ཀྱི་ཁམས་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: They do not apprehend the notion that conditioned elements are empty, or the notion that they are not empty.

source: །འདུས་མ་བྱས་ཀྱི་ཁམས་སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བར་མི་དམིགས་ཏེ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་ཅིང་། ཟས་སམ། སྐོམ་འམ། བཞོན་པ་འམ། གོས་སམ། མེ་ཏོག་གམ། ཕྲེང་བ་འམ། སྤོས་སམ། བྱུག་པ་འམ།
en: They do not apprehend the notion that unconditioned elements are empty, or the notion that they are not empty. “

source: མལ་ཆ་འམ། གནས་སམ། འཚོ་བ་འམ། ཡོ་བྱད་དམ། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་སྦྱིན་པ་གང་དང་གང་གཏོང་ཡང་དེས་སྦྱིན་པ་དེ་ཡང་སྟོང་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Practicing this perfection of wisdom accordingly, even though they dispense their gifts of food, drink, transport, clothing, flowers, garlands, incense, unguents, bedding, sanctuary, sustenance, resources, or whatever is of use to human beings, they do not observe the notion that these gifts are empty, [or the notion that they are not empty].

source: །གང་ཡོངས་སུ་གཏོང་བ་དང་། གང་ལ་ཡོངས་སུ་གཏོང་བ་དེ་ཡང་སྟོང་ཞེས་བྱ་བ་འམ། མི་སྟོང་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། དེ་ལ་འཇུངས་པའི་སེམས་སམ།
en: Nor do they observe the notion that the one who dispenses these gifts and the one to whom they are dispensed are empty or the notion that they are not empty.

source: ཡོངས་སུ་འཛིན་པའི་སེམས་ཀྱི་སྐབས་མེད་དོ།
en: In that regard there is no occasion for miserliness or acquisitiveness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: If you ask why, for bodhisattva great beings who practice the perfection of wisdom, all such notions will not arise, {Ki.

source: སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་རྣམ་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་མེད་དེ།
en: V: 98} from the time when they first begin to set their mind on enlightenment, until they are seated at the site of enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལ་ཇི་ལྟར་འཇུངས་པའི་ཐུགས་སམ། ཡོངས་སུ་འཛིན་པའི་ཐུགས་མི་མངའ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལ་ཡང་འཇུངས་པའི་སེམས་སམ། ཡོངས་སུ་འཛིན་པའི་སེམས་སྐྱེ་བ་མེད་དོ།
en: Just as the tathāgatas, arhats, completely awakened buddhas who attain consummate buddhahood in unsurpassed, complete enlightenment are never miserly or acquisitive, so also for bodhisattva great beings who practice the perfection of wisdom thoughts of miserliness or acquisitiveness do not arise.

source: །དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྟོན་པའོ།
en: This actual perfection of wisdom is the teacher of bodhisattva great beings.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: It is in this way, Subhūti, that bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of generosity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will bodhisattva great beings, abiding in the perfection of wisdom, acquire the perfection of ethical discipline?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་སའི་གོ་སྐབས་མི་འབྱེད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “bodhisattva great beings, abiding in the perfection of wisdom, have no occasion to be associated with the level of the śrāvakas or the level of the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ཡང་མི་དམིགས། སེམས་དེ་ཡང་མི་དམིགས་ཏེ།
en: If you ask why, it is because they do not apprehend even the level of the śrāvakas or the level of the pratyekabuddhas, nor indeed do they apprehend such thoughts.

source: དེ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་བདག་གིས་ཀྱང་སྲོག་གཅོད་པ་སྤངས་པ་ཡིན། གཞན་ཡང་སྲོག་གཅོད་པ་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་ཡིན།
en: From the time when they first begin to set their mind on enlightenment until they are seated at the site of enlightenment, they abstain from killing living creatures, and encourage others also to keep abstaining from killing living creatures.

source: སྲོག་གཅོད་པ་སྤོང་བའི་ལེགས་པ་བརྗོད་པ་ཡིན། གཞན་གང་གིས་སྲོག་གཅོད་པ་སྤངས་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་པ་ཡིན། བདག་གིས་ཀྱང་མ་བྱིན་པར་ལེན་པ་དང་།
en: They praise abstention from killing living creatures, and they praise and take empathetic delight in others abstaining from killing living creatures.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པའི་ཚིག་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་།
en: They themselves abstain from stealing, sexual misconduct, the telling of lies, slander, words of reprimand, nonsensical chatter, covetousness, malice, and wrong views, and they encourage others also to keep abstaining from wrong views [and so forth].
